"""
2. Пользователь вводит строку из нескольких слов,
разделённых пробелами. Вывести каждое слово с новой строки.
Строки необходимо пронумеровать. Если слово длинное,
выводить только первые 10 букв в слове.

Пример:
Введите слова через пробел: раз два три
1. раз
2. два
3. три

Введите слова через пробел: раз перерефрижерированность
1. раз
2. перерефриж
"""

lst = input('Введите слова через пробел: ').split()

for i, lst in enumerate(lst):
    if len(lst) < 10:
        print(f'{i + 1}. {lst}')
    else:
        print(f'{i + 1}. {lst[:10]}')
